[
    {
        "mealTitle": "Scrambled Eggs",
        "mealType": "Breakfast",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": "Eggs, Salt, Pepper, Butter",
        "description": "Indulge in the delightful flavors of perfectly seasoned scrambled eggs, cooked to perfection with a hint of salt and pepper, and a touch of creamy butter. This classic breakfast dish is a go-to for a hearty and satisfying morning meal that never fails to please. Whether enjoyed on its own or paired with your favorite breakfast sides, these scrambled eggs are a timeless choice for starting your day right.",
        "price": 7.99,
        "rating": 4,
        "time": "08:00 AM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Avocado Toast",
        "mealType": "Breakfast",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Avocado", "Bread", "Salt", "Pepper", "Olive Oil"],
        "description": "Elevate your morning with our nutritious Avocado Toast. Sliced ripe avocados sit atop a bed of toasted artisan bread, drizzled with olive oil, and seasoned to perfection with a sprinkle of salt and pepper. This breakfast option not only tastes fantastic but also provides a healthy dose of essential nutrients. The creamy texture of avocado combined with the crunch of toast creates a harmonious culinary experience that will leave you energized and satisfied. Avocado Toast – a modern classic to kickstart your day!",
        "price": 9.99,
        "rating": 5,
        "time": "08:30 AM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Pancakes",
        "mealType": "Breakfast",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Flour", "Milk", "Eggs", "Baking Powder", "Maple Syrup"],
        "description": "Treat yourself to a stack of fluffy, golden Pancakes for the ultimate breakfast experience. Made with a delightful batter of fresh milk, farm-fresh eggs, and a touch of baking powder, these pancakes are cooked to perfection on the griddle. Served with a generous drizzle of rich maple syrup, each bite is a symphony of sweet and savory flavors. Whether enjoyed as a morning indulgence or a delightful brunch option, our Pancakes are a timeless classic that promises to satisfy your cravings and brighten your day with every delicious bite.",
        "price": 10.99,
        "rating": 3,
        "time": "09:00 AM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Chicken Caesar Salad",
        "mealType": "Lunch",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Chicken", "Romaine Lettuce", "Croutons", "Parmesan Cheese", "Caesar Dressing"],
        "description": "Indulge in the classic flavors of our Chicken Caesar Salad – a timeless lunch option that combines crisp Romaine lettuce, succulent grilled chicken, crunchy croutons, and a generous sprinkling of Parmesan cheese. Drizzled with our signature Caesar dressing, this salad offers a perfect balance of textures and tastes. Whether you're looking for a light and refreshing midday meal or a satisfying lunch option, our Chicken Caesar Salad is the ideal choice. Elevate your lunchtime experience with the perfect blend of fresh ingredients and savory goodness.",
        "price": 12.99,
        "rating": 4,
        "time": "12:30 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Vegetarian Wrap",
        "mealType": "Lunch",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Hummus", "Vegetables", "Tortilla", "Feta Cheese"],
        "description": "Savor the delicious medley of flavors in our Vegetarian Wrap – a wholesome and satisfying lunch option. Packed with creamy hummus, crisp vegetables, and tangy feta cheese, all neatly wrapped in a soft tortilla, this vegetarian delight is a perfect balance of textures and tastes. Whether you follow a vegetarian diet or simply appreciate a flavorful and nutritious lunch, our Vegetarian Wrap is the ideal choice. Enjoy a burst of freshness and goodness in every bite, and make your lunchtime a delightful experience with this delicious and satisfying wrap.",
        "price": 11.99,
        "rating": 5,
        "time": "01:00 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Spaghetti Bolognese",
        "mealType": "Lunch",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Ground Beef", "Tomato Sauce", "Spaghetti", "Onion", "Garlic"],
        "description": "Indulge in the rich and hearty flavors of our Spaghetti Bolognese – a classic Italian dish that never fails to satisfy. Made with the finest ground beef, simmered in a robust tomato sauce, and served over perfectly cooked spaghetti, this dish is a celebration of comforting and savory goodness. Each forkful brings together the perfect blend of savory meat, aromatic garlic, and the sweetness of tomato sauce. Whether you're a fan of Italian cuisine or simply crave a delicious and filling lunch, our Spaghetti Bolognese is the ultimate choice for a satisfying and flavorful midday meal.",
        "price": 13.99,
        "rating": 4,
        "time": "01:30 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Grilled Salmon",
        "mealType": "Dinner",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Salmon", "Lemon", "Garlic", "Olive Oil"],
        "description": "Experience the exquisite taste of our Grilled Salmon – a delectable dinner option that combines the richness of fresh salmon with the zesty flavors of lemon and garlic. Each succulent piece of salmon is carefully marinated and grilled to perfection, resulting in a dish that is both tender and flavorful. Drizzled with a touch of olive oil, this grilled salmon offers a delightful combination of textures and tastes. Whether you're a seafood enthusiast or simply looking for a wholesome and delicious dinner, our Grilled Salmon promises to be a memorable culinary experience.",
        "price": 18.99,
        "rating": 4,
        "time": "07:00 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    }  ,{
        "mealTitle": "Vegetable Stir-Fry",
        "mealType": "Dinner",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Broccoli", "Bell Pepper", "Carrots", "Soy Sauce"],
        "description": "Delight in the vibrant and savory goodness of our Vegetable Stir-Fry – a colorful and nutritious dinner option that brings together a medley of fresh broccoli, bell peppers, and carrots, all stir-fried to perfection and seasoned with a flavorful soy sauce. This vegetarian stir-fry is a feast for the senses, offering a delightful crunch and a burst of umami in every bite. Whether you follow a vegetarian diet or simply enjoy a delicious and healthy dinner, our Vegetable Stir-Fry is the perfect choice to end your day on a high note.",
        "price": 16.99,
        "rating": 3,
        "time": "07:30 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    },
    {
        "mealTitle": "Margherita Pizza",
        "mealType": "Dinner",
        "mealImage": "https://www.southernliving.com/thmb/iL2CEgCAMqC4cpp6taRqwYQI1gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27162_FGFsuperbowl_0359_16x9-2000-5dd253dc23044ee78aacd9673f5befbc.jpg",
        "ingredients": ["Pizza Dough", "Tomato Sauce", "Mozzarella Cheese", "Basil"],
        "description": "Indulge in the classic flavors of Italy with our Margherita Pizza. Our expertly crafted pizza starts with a perfectly baked crust, topped with rich tomato sauce made from vine-ripened tomatoes, and a generous layer of premium mozzarella cheese that melts to perfection. The finishing touch is the aromatic basil leaves, adding a burst of freshness to every bite. Each slice promises a harmonious blend of textures and tastes, making it a delightful experience for your taste buds. Whether you're a pizza connoisseur or trying it for the first time, our Margherita Pizza is a timeless and satisfying choice for a delicious dinner.",
        "price": 14.99,
        "rating": 5,
        "time": "08:00 PM",
        "date": "2023-11-24",
        "likes": 0,
        "reviews": 0,
        "adminName": "Riyad Sm",
        "adminEmail": "smriyad0185@gmail.com",
        "likeEmails": []
    }]